nrfconnect/sdk-nrf/drivers/wifi/nrf700x/zephyr/src/qspi/src/qspi_if.c
	if (ret < 0)
		LOG_DBG("cmd_encryption failed %d\n", ret);

	return ret;
}
#endif

int qspi_RDSR2(const struct device *dev, uint8_t *rdsr2)
{
	int ret = 0;
	uint8_t sr = 0;

	const struct qspi_buf sr_buf = {
		.buf = &sr,
		.len = sizeof(sr),
	};
	struct qspi_cmd cmd = {
		.op_code = 0x2f,
		.rx_buf = &sr_buf,
	};

	ret = qspi_device_init(dev);

	ret = qspi_send_cmd(dev, &cmd, false);

	qspi_device_uninit(dev);

	LOG_DBG("RDSR2 = 0x%x\n", sr);

	if (ret == 0)
		*rdsr2 = sr;

	return ret;
}

/* Wait until RDSR2 confirms RPU_WAKE write is successful */
int qspi_validate_rpu_wake_writecmd(const struct device *dev)
{
	int ret = 0;
	uint8_t rdsr2 = 0;

	for (int ii = 0; ii < 1; ii++) {
		ret = qspi_RDSR2(dev, &rdsr2);
		if (ret && (rdsr2 & RPU_WAKEUP_NOW)) {
			return 0;
		}
	}

	return rdsr2;
}


int qspi_RDSR1(const struct device *dev, uint8_t *rdsr1)
{
	int ret = 0;
	uint8_t sr = 0;

	const struct qspi_buf sr_buf = {
		.buf = &sr,
		.len = sizeof(sr),
	};
	struct qspi_cmd cmd = {
		.op_code = 0x1f,
		.rx_buf = &sr_buf,
	};

	ret = qspi_device_init(dev);

	ret = qspi_send_cmd(dev, &cmd, false);

	qspi_device_uninit(dev);

	LOG_DBG("RDSR2 = 0x%x\n", sr);

	if (ret == 0)
		*rdsr1 = sr;

	return ret;
}

/* Wait until RDSR1 confirms RPU_AWAKE/RPU_READY */
int qspi_wait_while_rpu_awake(const struct device *dev)
{
	int ret;
	uint8_t val = 0;

	for (int ii = 0; ii < 10; ii++) {
		ret = qspi_RDSR1(dev, &val);

		LOG_DBG("RDSR1 = 0x%x\n", val);

		if (!ret && (val & RPU_AWAKE_BIT)) {
			break;
		}

		k_msleep(1);
	}

	/* Configure DTS settings */
	if (val & RPU_AWAKE_BIT) {
		/* Restore QSPI clock frequency from DTS */
		QSPIconfig.phy_if.sck_freq = qspi_dts_freq_to_sckfreq();
	}

	return val;
}

/* Wait until RDSR1 confirms RPU_AWAKE/RPU_READY and Firmware is booted */
int qspi_wait_while_firmware_awake(const struct device *dev)
{
	int ret = 0;
	uint8_t sr = 0;

	const struct qspi_buf sr_buf = {
		.buf = &sr,
		.len = sizeof(sr),
	};
	struct qspi_cmd cmd = {
		.op_code = 0x1f,
		.rx_buf = &sr_buf,
	};

	for (int ii = 0; ii < 10; ii++) {
		int ret;

		ret = qspi_device_init(dev);

		if (ret == 0)
			ret = qspi_send_cmd(dev, &cmd, false);

		qspi_device_uninit(dev);

		if ((ret < 0) || (sr != 0x6)) {
			LOG_DBG("ret val = 0x%x\t RDSR1 = 0x%x\n", ret, sr);
		} else {
			LOG_DBG("RDSR1 = 0x%x\n", sr);
			LOG_INF("RPU is awake...\n");
			break;
		}
		k_msleep(1);
	}

	return ret;
}

int qspi_WRSR2(const struct device *dev, uint8_t data)
{
	const struct qspi_buf tx_buf = {
		.buf = &data,
		.len = sizeof(data),
	};
	const struct qspi_cmd cmd = {
		.op_code = 0x3f,
		.tx_buf = &tx_buf,
	};
	int ret = qspi_device_init(dev);

	if (ret == 0)
		ret = qspi_send_cmd(dev, &cmd, false);

	qspi_device_uninit(dev);

	if (ret < 0)
		LOG_ERR("cmd_wakeup RPU failed %d\n", ret);

	return ret;
}

int qspi_cmd_wakeup_rpu(const struct device *dev, uint8_t data)
{
	int ret;

	/* Waking RPU works reliably only with lowest frequency (8MHz) */
	QSPIconfig.phy_if.sck_freq = qspi_freq_mhz_to_sckfreq(8);

	ret = qspi_WRSR2(dev, data);

	return ret;
}

struct device qspi_perip = {
	.data = &qspi_nor_memory_data,
};

int qspi_deinit(void)
{
	LOG_DBG("TODO : %s\n", __func__);

	return 0;
}

int qspi_init(struct qspi_config *config)
{
	unsigned int rc;

	qspi_config = config;

	config->readoc = config->quad_spi ? NRF_QSPI_READOC_READ4IO : NRF_QSPI_READOC_FASTREAD;
	config->writeoc = config->quad_spi ? NRF_QSPI_WRITEOC_PP4IO : NRF_QSPI_WRITEOC_PP;

	rc = qspi_nor_init(&qspi_perip);

	k_sem_init(&qspi_config->lock, 1, 1);

	LOG_INF("QSPI freq = %d MHz\n", INST_0_SCK_FREQUENCY/MHZ(1));
	LOG_INF("QSPI latency = %d\n", qspi_config->qspi_slave_latency);
	return rc;
}

void qspi_update_nonce(unsigned int addr, int len, int hlread)
{
#if defined(CONFIG_SOC_SERIES_NRF53X)

	NRF_QSPI_Type *p_reg = NRF_QSPI;

	if (!qspi_config->encryption)
		return;

	if (nonce_last_addr == 0 || hlread)
		p_reg->DMA_ENC.NONCE2 = ++nonce_cnt;
	else if ((nonce_last_addr + 4) != addr)
		p_reg->DMA_ENC.NONCE2 = ++nonce_cnt;

	nonce_last_addr = addr + len - 4;

#endif
}

void qspi_addr_check(unsigned int addr, const void *data, unsigned int len)
{
	if ((addr % 4 != 0) || (((unsigned int)data) % 4 != 0) || (len % 4 != 0)) {
		LOG_ERR("%s : Unaligned address %x %x %d %x %x\n", __func__, addr,
		       (unsigned int)data, (addr % 4 != 0), (((unsigned int)data) % 4 != 0),
		       (len % 4 != 0));
	}
}

int qspi_write(unsigned int addr, const void *data, int len)
{
	int status;

	qspi_addr_check(addr, data, len);

	addr |= qspi_config->addrmask;

	k_sem_take(&qspi_config->lock, K_FOREVER);

	qspi_update_nonce(addr, len, 0);

	status = qspi_nor_write(&qspi_perip, addr, data, len);

	k_sem_give(&qspi_config->lock);

	return status;
}

int qspi_read(unsigned int addr, void *data, int len)
{
	int status;

	qspi_addr_check(addr, data, len);

	addr |= qspi_config->addrmask;

	k_sem_take(&qspi_config->lock, K_FOREVER);

	qspi_update_nonce(addr, len, 0);

	status = qspi_nor_read(&qspi_perip, addr, data, len);

	k_sem_give(&qspi_config->lock);

	return status;
}

int qspi_hl_readw(unsigned int addr, void *data)
{
	int status;
	uint8_t *rxb = NULL;
	uint32_t len = 4;

	len = len + (4 * qspi_config->qspi_slave_latency);

	rxb = k_malloc(len);

	if (rxb == NULL) {
		LOG_ERR("%s: ERROR ENOMEM line %d\n", __func__, __LINE__);
		return -ENOMEM;
	}

	memset(rxb, 0, len);

	k_sem_take(&qspi_config->lock, K_FOREVER);

	qspi_update_nonce(addr, 4, 1);

	status = qspi_nor_read(&qspi_perip, addr, rxb, len);

	k_sem_give(&qspi_config->lock);

	*(uint32_t *)data = *(uint32_t *)(rxb + (len - 4));

	k_free(rxb);

	return status;
}

int qspi_hl_read(unsigned int addr, void *data, int len)
{
	int count = 0;

	qspi_addr_check(addr, data, len);

	while (count < (len / 4)) {
		qspi_hl_readw(addr + (4 * count), ((char *)data + (4 * count)));
		count++;
	}

	return 0;
}

int qspi_cmd_sleep_rpu(const struct device *dev)
{
	uint8_t data = 0x0;

	/* printf("TODO : %s:\n", __func__); */
	const struct qspi_buf tx_buf = {
		.buf = &data,
		.len = sizeof(data),
	};

	const struct qspi_cmd cmd = {
		.op_code = 0x3f, /* 0x3f, //WRSR2(0x3F) WakeUP RPU. */
		.tx_buf = &tx_buf,
	};

	int ret = qspi_device_init(dev);

	if (ret == 0) {
		ret = qspi_send_cmd(dev, &cmd, false);
	}

	qspi_device_uninit(dev);

	if (ret < 0) {
		LOG_ERR("cmd_wakeup RPU failed: %d\n", ret);
	}

	return ret;
}

/* Encryption public API */

int qspi_enable_encryption(uint8_t *key)
{
#if defined(CONFIG_SOC_SERIES_NRF53X)
	int err = 0;

	if (qspi_config->encryption)
		return -EALREADY;

	memcpy(qspi_config->p_cfg.key, key, 16);

	err = nrfx_qspi_dma_encrypt(&qspi_config->p_cfg);
	if (err != NRFX_SUCCESS) {
		LOG_ERR("nrfx_qspi_dma_encrypt failed: %d\n", err);
		return -EIO;
	}

	err = qspi_cmd_encryption(&qspi_perip, &qspi_config->p_cfg);
	if (err != 0) {
		LOG_ERR("qspi_cmd_encryption failed: %d\n", err);
		return -EIO;
	}

	qspi_config->encryption = true;

	return 0;
#else
	return -ENOTSUP;
#endif
}
